# Основы pandas

In [10]:
import pandas as pd

Пример забора данных с сайтов

In [11]:
pd.read_html('http://www.cbr.ru')[2]

IndexError: list index out of range

In [186]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [187]:
df[:5][1]

       Имя  Unnamed: 1     %     курс                 Дата
0  EUR/RUB         NaN   994   921455  07.10.2020 13:13:00
1  USD/RUB         NaN -1164    78364  07.10.2020 13:13:00
2  CHF/RUB         NaN -1229    85349  07.10.2020 13:14:00
3  JPY/RUB         NaN -5537     7386  07.10.2020 13:14:00
4  GBP/RUB         NaN  -939  1009321  07.10.2020 13:14:00
5  NOK/RUB         NaN  2837    83992  07.10.2020 13:14:00
6  AUD/RUB         NaN  2355   558423  07.10.2020 13:14:00
7  NZD/RUB         NaN   -99   516264  07.10.2020 13:14:00
8  TRY/RUB         NaN -7293    99803  07.10.2020 13:14:00

Импорт данных из файла

In [25]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [ ]:
data.tail()

In [ ]:
type(data)

In [ ]:
# если надо указать свои заголовки и разделитель
# data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
# data.head()

In [ ]:
# количество строк в датафрейме

len(data)

In [ ]:
# или так

data.shape

Простые вычисления для нового столбца

In [ ]:
data['year_plus_one'] = data['year'] + 1
data.head()

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

### Основные сведения о датафрейме

In [ ]:
data.info()

In [ ]:
# немного статистики

data.describe()

### Отдельный столбец (тип Series)

In [ ]:
data['year'].head()

In [ ]:
# или так

data.year.head()

In [ ]:
type(data['year'])

In [ ]:
data.head()

In [ ]:
# уникальные значения в столбце

data['category'].unique()

In [ ]:
len(data['category'].unique())

In [ ]:
data['category'].head()

In [74]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: category, dtype: int64

In [ ]:
data['category'].value_counts(normalize=True).head()

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

# Фильтры

In [22]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [23]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [24]:
# или так

data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

### Отфильтруем строки с потреблением выше среднего

In [38]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [39]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [40]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [41]:
# самый популярный способ

data[ data.quantity > average_level ].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

### Как определить используемый вариант названия страны?

In [19]:
data['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra',
       'Angola', 'Anguilla', 'Antarctic Fisheries', 'Antigua and Barbuda',
       'Argentina', 'Armenia', 'Aruba', 'Australia', 'Austria',
       'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados',
       'Belarus', 'Belgium', 'Belize', 'Benin', 'Bermuda', 'Bhutan',
       'Bolivia (Plur. State of)', 'Bonaire, St Eustatius, Saba',
       'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'British Virgin Islands', 'Brunei Darussalam', 'Bulgaria',
       'Burkina Faso', 'Burundi', 'Cabo Verde', 'Cambodia', 'Cameroon',
       'Canada', 'Cayman Islands', 'Central African Rep.', 'Chad',
       'Chile', 'China', 'China, Hong Kong SAR', 'China, Macao SAR',
       'Colombia', 'Commonwealth of Independent States (CIS)', 'Comoros',
       'Congo', 'Cook Islands', 'Costa Rica', 'Croatia', 'Cuba',
       'Curaçao', 'Cyprus', 'Czechia', 'Czechoslovakia (former)',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Denmark', 'Djibouti',
       'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Ethiopia', 'Ethiopia, incl. Eritrea', 'Faeroe Islands',
       'Falkland Is. (Malvinas)', 'Fiji', 'Finland', 'France',
       'French Guiana', 'French Polynesia', 'Gabon', 'Gambia', 'Georgia',
       'German Dem. R. (former)', 'Germany', 'Germany, Fed. R. (former)',
       'Ghana', 'Gibraltar', 'Greece', 'Greenland', 'Grenada',
       'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras', 'Hungary',
       'Iceland', 'India', 'Indonesia', 'Iran (Islamic Rep. of)', 'Iraq',
       'Ireland', 'Isle of Man', 'Israel', 'Italy', 'Jamaica', 'Japan',
       'Jersey', 'Jordan', 'Kazakhstan', 'Kenya', 'Kiribati',
       "Korea, Dem.Ppl's.Rep.", 'Korea, Republic of', 'Kuwait',
       'Kyrgyzstan', "Lao People's Dem. Rep.", 'Latvia', 'Lebanon',
       'Lesotho', 'Liberia', 'Libya', 'Liechtenstein', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Marshall Islands', 'Martinique', 'Mauritania',
       'Mauritius', 'Mayotte', 'Mexico', 'Micronesia (Fed. States of)',
       'Mongolia', 'Montenegro', 'Montserrat', 'Morocco', 'Mozambique',
       'Myanmar', 'Namibia', 'Nauru', 'Nepal', 'Neth. Antilles (former)',
       'Netherlands', 'New Caledonia', 'New Zealand', 'Nicaragua',
       'Niger', 'Nigeria', 'Niue', 'Northern Mariana Islands', 'Norway',
       'Oman', 'Other Asia', 'Pacific Islands (former)', 'Pakistan',
       'Palau', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru',
       'Philippines', 'Poland', 'Portugal', 'Puerto Rico', 'Qatar',
       'Republic of Moldova', 'Romania', 'Russian Federation', 'Rwanda',
       'Réunion', 'Samoa', 'Sao Tome and Principe', 'Saudi Arabia',
       'Senegal', 'Serbia', 'Serbia and Montenegro', 'Seychelles',
       'Sierra Leone', 'Singapore', 'Sint Maarten (Dutch part)',
       'Slovakia', 'Slovenia', 'Solomon Islands', 'Somalia',
       'South Africa', 'South Sudan', 'Spain', 'Sri Lanka',
       'St. Helena and Depend.', 'St. Kitts-Nevis', 'St. Lucia',
       'St. Pierre-Miquelon', 'St. Vincent-Grenadines',
       'State of Palestine', 'Sudan', 'Sudan (former)', 'Suriname',
       'Swaziland', 'Sweden', 'Switzerland', 'Syrian Arab Republic',
       'T.F.Yug.Rep. Macedonia', 'Tajikistan', 'Thailand', 'Timor-Leste',
       'Togo', 'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey',
       'Turkmenistan', 'Turks and Caicos Islands', 'Tuvalu',
       'USSR (former)', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'United Rep. of Tanzania', 'United States',
       'United States Virgin Is.', 'Uruguay', 'Uzbekistan', 'Vanuatu',
       'Venezuela (Bolivar. Rep.)', 'Viet Nam', 'Wallis and Futuna Is.',
       'Yemen', 'Yemen Arab Rep. (former)', 'Yemen, Dem. (former)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Zimbabwe'], dtype=object)

In [20]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Australia', 'Austria', 'Belarus', 'Bonaire, St Eustatius, Saba',
       'Brunei Darussalam', 'Cyprus', 'Mauritius', 'Russian Federation',
       'USSR (former)'], dtype=object)

In [21]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

        country  year  quantity  category
832711  Belarus  1992  689382.0        42
817972  Belarus  1992  677771.0        42
836441  Belarus  1992  511257.0        42
840600  Belarus  1992  511257.0        42
535832  Belarus  1992  393559.0        32

In [ ]:
filtered_countries['country'].unique()

In [ ]:
# фильтры на номер строки

data.loc[1000:1005]

# Сортировка

In [29]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

NameError: name 'data' is not defined

In [ ]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

In [ ]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).head(50)

### Параметр inplace

In [16]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [17]:
data.sort_values('country', ascending=True, inplace=rewrite)

NameError: name 'rewrite' is not defined

In [18]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?

# Домашнее задание

# Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [9]:
import pandas as pd

In [33]:
header_list = ["UserID", "MovieID", "Rating", "Timestamp"]
ratings_hw = pd.read_csv('ml-10M100K/ratings.dat', names=header_list, sep='::', engine='python')
ratings_hw.head()

   UserID  MovieID  Rating  Timestamp
0       1      122     5.0  838985046
1       1      185     5.0  838983525
2       1      231     5.0  838983392
3       1      292     5.0  838983421
4       1      316     5.0  838983392

In [56]:
film = ratings_hw[ratings_hw["Rating"] == 5]["MovieID"].value_counts()
film.head()

318    16460
296    14973
593    13054
527    12813
260    12519
Name: MovieID, dtype: int64

# №Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [153]:
data_country = pd.read_csv('power.csv')
data_country.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [154]:
#scan_country = data_country[(data_country["year"] >= 2005) & (data_country["year"] <= 2010)]
scan_country = data_country[(data_country["year"] >= 2005) & (data_country["year"] <= 2010)].sort_values("year", ascending=False)
scan_country.head()

             country  year   quantity  category
6            Belgium  2010      22.00         1
524120  South Africa  2010  189358.00        31
524074      Slovakia  2010    4163.00        31
524052     Singapore  2010       0.49        31
524012        Serbia  2010     147.00        31

In [155]:
scan_country1 = scan_country[(scan_country["country"] == 'Latvia') | (scan_country["country"] == 'Lithuania') | (scan_country["country"] == 'Estonia')]
scan_country1.head()

          country  year  quantity  category
523253  Lithuania  2010     144.0        31
523164     Latvia  2010     167.0        31
525671  Lithuania  2010       2.0        31
525648     Latvia  2010      21.0        31
525190    Estonia  2010       2.0        31

In [156]:
scan_country2 = scan_country1[(scan_country["category"] == 4) | (scan_country["category"] == 12) | (scan_country["category"] == 21)]
scan_country2.head(100)

<ipython-input-156-62fd4d1a24a9>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  scan_country2 = scan_country1[(scan_country["category"] == 4) | (scan_country["category"] == 12) | (scan_country["category"] == 21)]

          country  year  quantity  category
253561    Estonia  2010     108.0        21
253981  Lithuania  2010     133.0        21
253962     Latvia  2010      32.0        21
243151  Lithuania  2010    3545.0        21
243029     Latvia  2010    2557.0        21
...           ...   ...       ...       ...
224869     Latvia  2009       5.0        21
224563    Estonia  2009       0.0        21
241830    Estonia  2009    2647.0        21
222208     Latvia  2009      16.0        21
222281  Lithuania  2009     195.0        21

[100 rows x 4 columns]

In [158]:
sum_country = sum(scan_country['quantity'] > 0) 
sum_country

293891

# Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [171]:
page_hw = 'https://www.finanz.ru/indeksi/nasdaq_composite'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_hw, attrs = {'class': 'header_user_pricebox'}, encoding='utf-8')

In [188]:
df[:5][1]

       Имя  Unnamed: 1     %     курс                 Дата
0  EUR/RUB         NaN   994   921455  07.10.2020 13:13:00
1  USD/RUB         NaN -1164    78364  07.10.2020 13:13:00
2  CHF/RUB         NaN -1229    85349  07.10.2020 13:14:00
3  JPY/RUB         NaN -5537     7386  07.10.2020 13:14:00
4  GBP/RUB         NaN  -939  1009321  07.10.2020 13:14:00
5  NOK/RUB         NaN  2837    83992  07.10.2020 13:14:00
6  AUD/RUB         NaN  2355   558423  07.10.2020 13:14:00
7  NZD/RUB         NaN   -99   516264  07.10.2020 13:14:00
8  TRY/RUB         NaN -7293    99803  07.10.2020 13:14:00